---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateWeight
source: html/88c95a30-6091-0f42-9c4a-ff326afd0d86.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemPlateWeight Property

"Weight"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemPlateWeight { get; }
```